Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetHandler.CreateCurvedDimensionSetOrthogonal Method (ViewBase, Point, Point, Point, PointList, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a curved dimension set with orthogonal reference lines from the specified points and inserts it to the database.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetOrthogonal CreateCurvedDimensionSetOrthogonal(
	ViewBase View,
	Point ArcPoint1,
	Point ArcPoint2,
	Point ArcPoint3,
	PointList DimensionPoints,
	double Distance,
	CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Attributes
)
Public Function CreateCurvedDimensionSetOrthogonal (
	View As ViewBase,
	ArcPoint1 As Point,
	ArcPoint2 As Point,
	ArcPoint3 As Point,
	DimensionPoints As PointList,
	Distance As Double,
	Attributes As CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
) As CurvedDimensionSetOrthogonal
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
ArcPoint1
Type: Tekla.Structures.Geometry3d.Point
The first arc point to be used.
ArcPoint2
Type: Tekla.Structures.Geometry3d.Point
The second arc point to be used.
ArcPoint3
Type: Tekla.Structures.Geometry3d.Point
The third arc point to be used.
DimensionPoints
Type: Tekla.Structures.Drawing.PointList
The dimension points to be used.
Distance
Type: System.Double
The distance to be used.
Attributes
Type: Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
The attributes to be used.
Return Value
Type: CurvedDimensionSetOrthogonal
The created dimension set or null if failed.
See Also
Reference
CurvedDimensionSetHandler Class
CreateCurvedDimensionSetOrthogonal Overload
Tekla.Structures.Drawing Namespace